# Задача 1: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |


# n = int(input('Сколько машина проезжает за день: '))

# m = int(input('Введите длину маршрута: '))

# print(f"Нужно {(m//n) + bool(m%n)} дней")


num = int(input('Введите трёхзначное число: '))
num1 = int(num/100)
num2 = int(num%100)//10
num3 = int(num%100)%10
print(f"Сумма цифр равна: {(num1 + num2 + num3)}")
