# Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     6
#     -> 5

col = int(input('Введите количество элементов в списке: '))
elems = map(int, (input('Введите элементы списка через пробел: ').split()))
list = list(map(int, elems))
if len(list) != col or col == 0:
    print('Количество введённых элементов не соответствуют заявленному количеству!')
else:
    n = int(input('Введите число, с которым необходимо сравнивать элементы списка: '))
    min = abs(n - list[0])
    index = 0
    for i in range(1, col):
        count = abs(n - list[i])
        if count < min:
            min = count
            index = i
    print(f'Число {list[index]} в списке наиболее близко по величине к числу {n}')