# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     3
#     -> 1


col = int(input('Введите количество элементов в списке: '))
elems = map(int, (input('Введите элементы списка через пробел: ').split()))
list = list(map(int, elems))
if len(list) != col:
    print('Количество введённых элементов не соответствуют заявленному количеству!')
else:
    n = int(input('Введите число, которое необходимо найти в списке: '))
    count = 0
    for i in list:
        if i == n:
            count += 1
    print(f'Число {n} встречается в списке {count} раз(а)')

